Repository: KaufmannDigital/KaufmannDigital.GDPR.CookieConsent
Catalog: Resources/Private/Translations/*/NodeTypes/Content/CookieSettings.xlf
Languages: de, es, fr, nl

# ui.label
source: Cookie Settings
de: Cookie Einstellungen
es: Configuración de cookies
fr: Paramètres des cookies
nl: Cookie instellingen

# ui.inspector.groups.cookieSettings.label
source: Cookie Settings
de: Cookie Einstellungen
es: Configuración de cookies
fr: Paramètres des cookies
nl: Cookie instellingen

# properties.headline.ui.inline.editorOptions.placeholder
source: Insert title...
de: Überschrift eintragen...
es: Entra en la cabeza...
fr: Entrer dans la tête...
nl: Kop invoeren...

# properties.mainDescription.ui.inline.editorOptions.placeholder
source: Insert description...
de: Beschreibung eintragen...
es: Introduzca la descripción...
fr: Entrez la description...
nl: Beschrijving invoeren...

# properties.individualSettingsDescription.ui.inline.editorOptions.placeholder
source: Insert description...
de: Beschreibung eintragen...
es: Introduzca la descripción...
fr: Entrez la description...
nl: Beschrijving invoeren...

# properties.imprintLink
source: Link to imprint
de: Link zum Impressum
es: Enlace al pie de imprenta
fr: Lien vers l'impression
nl: Link naar de imprint

# properties.dataProtectionPolicyLink
source: Link to data protection policy
de: Link zur Datenschutzerklärung
es: Enlace a la política de privacidad
fr: Lien vers la politique de confidentialité
nl: Link naar het privacybeleid

# properties.acceptAllButtonLabel
source: "Accept all" label
de: Label "Alle akzeptieren"
es: Etiqueta "Aceptar todo"
fr: Label "Accepter tout"
nl: Label "Alles accepteren"

# properties.saveButtonLabel
source: "Save" label
de: Label "Speichern"
es: Etiqueta "Guardar"
fr: Label "Enregistrer"
nl: Label "Opslaan"

# properties.acceptNecessaryCookiesLabel
source: "Accept necessary cookies" label
de: Label "Notwendige Cookies akzeptieren"
es: Etiqueta "Aceptar cookies necesarias"
fr: Label "Accepter les cookies nécessaires"
nl: Label "Accepteer noodzakelijke cookies"

# properties.imprintLabel
source: "Imprint" label
de: Label "Impressum"
es: Etiqueta "Impressum"
fr: Label "Impressum"
nl: Label "Impressum"

# properties.dataProtectionPolicyLabel
source: "Data protection policy" label
de: Label "Datenschutzerklärung"
es: Etiqueta "Política de privacidad"
fr: Label "Politique de confidentialité"
nl: Label "Privacybeleid"

# properties.openIndividualSettingsLabel
source: "Individual settings" label
de: Label "Individuelle Einstellungen"
es: Etiqueta "Ajustes individuales"
fr: Label "Paramètres individuels"
nl: Label "Individuele instellingen"

# properties.closeIndividualSettingsLabel
source: "Close settings" label
de: Label "Einstellungen schließen"
es: Etiqueta "Cerrar ajustes"
fr: Label "Fermer les paramètres"
nl: Label "Instellingen sluiten"

# properties.versionDate
source: Version date
de: Versions-Datum
es: Fecha de la versión
fr: Date de la version
nl: Versiedatum

# properties.decisionTtl
source: TTL (Decision time in seconds)
de: TTL (Speicherdauer der Entscheidung in Sekunden)
es: TTL (tiempo de almacenamiento de la decisión en segundos)
fr: TTL (temps de stockage des décisions en secondes)
nl: TTL (opslagtijd voor beslissingen in seconden)

# properties.decisionTtl.ui.help.message
source: Number of seconds until cookie settings are displayed and confirmed again. Example values are: 86400 (1 day), 604800 (1 week), 2592000 (30 days), 31536000 (1 year)
es: Número de segundos hasta que se vuelve a mostrar y confirmar la configuración de las cookies. Algunos valores de ejemplo son: 86400 (1 día), 604800 (1 semana), 2592000 (30 días), 31536000 (1 año).
fr: Nombre de secondes avant que les paramètres des cookies ne soient réaffichés et confirmés. Exemples de valeurs : 86400 (1 jour), 604800 (1 semaine), 2592000 (30 jours), 31536000 (1 an).
nl: Aantal seconden tot de cookie-instellingen opnieuw worden weergegeven en bevestigd. Voorbeeldwaarden zijn: 86400 (1 dag), 604800 (1 week), 2592000 (30 dagen), 31536000 (1 jaar).

# properties.closeButtonEnabled
source: Show close-button
de: Zeige X (zum schließen)
es: Mostrar botón de cierre
fr: Afficher le bouton de fermeture
nl: Laat sluitknop zien

# properties.closeButtonEnabled.ui.help.message
source: Shows an "X" on the right top of the banner, if enabled. A click on the X hides the banner, but without making a decision. It re-appears on the next pageload.
es: Muestra una "X" en la esquina superior derecha, si está activada. Al hacer clic en esta X, el banner se cierra sin decisión. Volverá a aparecer la próxima vez que se acceda a la página.
fr: Affiche un "X" dans le coin supérieur droit, s'il est activé. En cliquant sur ce X, la bannière se ferme sans qu'aucune décision ne soit prise. Elle réapparaîtra lors du prochain accès à la page.
nl: Toont een "X" in de rechterbovenhoek, indien geactiveerd. Als je op deze X klikt, wordt de banner zonder beslissing gesloten. De volgende keer dat de pagina wordt opgeroepen, verschijnt deze weer.

# properties.excludedDocuments
source: Exclude for Documents
de: Exkludierte Dokumente
es: Excluir para documentos
fr: Exclure les documents
nl: Uitsluiten voor documenten

# properties.buttonTextColor.selectBoxEditor.values.white
source: White
de: Weiß
es: Blanco
fr: Blanc
nl: Wit

# properties.buttonTextColor.selectBoxEditor.values.black
source: Black
de: Schwarz
es: Negro
fr: Noir
nl: Zwart

# properties.backgroundColor
source: Background color (HEX)
de: Hintergrundfarbe (HEX)
es: Color de fondo (HEX)
fr: Couleur d'arrière-plan (HEX)
nl: Achtergrondkleur (HEX)

# properties.buttonTextColor
source: Button text color
de: Button Textfarbe
es: Color del texto del botón
fr: Couleur du texte du bouton
nl: Knop tekstkleur

# properties.themeColor
source: Theme color (HEX)
de: Theme-Farbe (HEX)
es: Color del tema (HEX)
fr: Couleur du thème (HEX)
nl: Themakleur (HEX)

# properties.maxWidth
source: Maximum content width (px)
de: Maximale Breite für Inhalte (px)
es: Anchura máxima del contenido (px)
fr: Largeur maximale du contenu (px)
nl: Maximale breedte inhoud (px)

# properties.decisionTtl.ui.help.message
source: Number of seconds until cookie settings are displayed and confirmed again. Example values are: 86400 (1 day), 604800 (1 week), 2592000 (30 days), 31536000 (1 year)
de: Anzahl der Sekunden, bis die Cookie-Einstellungen erneut angezeigt und bestätigt werden. Beispielwerte sind: 86400 (1 Tag), 604800 (1 Woche), 2592000 (30 Tage), 31536000 (1 Jahr)
